export default {
  message: {
    save_success: '儲存成功'
  },
  treeData: [
    {
      key: '1000000',
      value: '1000000',
      title: '家教技能',
      children: [
        {
          key: '1001000',
          value: '1001000',
          title: '伴讀/保姆',
          children: [
            {
              key: '1001001',
              value: '1001001',
              title: '伴讀',
            },
            {
              key: '1001002',
              value: '1001002',
              title: '保姆',
            },
            {
              key: '1001003',
              value: '1001003',
              title: '邏輯創造力訓練',
            },
            {
              key: '1001004',
              value: '1001004',
              title: '美勞/勞作',
            }
          ]
        },
        {
          key: '1002000',
          value: '1002000',
          title: '學科',
          children: [
            {
              key: '1002001',
              value: '1002001',
              title: '國文(語)',
            },
            {
              key: '1002002',
              value: '1002002',
              title: '數學',
            },
            {
              key: '1002003',
              value: '1002003',
              title: '理化',
            },
            {
              key: '1002004',
              value: '1002004',
              title: '物理',
            },
            {
              key: '1002005',
              value: '1002005',
              title: '化學',
            },
            {
              key: '1002006',
              value: '1002006',
              title: '歷史',
            },
            {
              key: '1002007',
              value: '1002007',
              title: '地理',
            },
            {
              key: '1002008',
              value: '1002008',
              title: '公民',
            },
            {
              key: '1002009',
              value: '1002009',
              title: '自然科學',
            },
            {
              key: '1002010',
              value: '1002010',
              title: '生物',
            },
            {
              key: '1002011',
              value: '1002011',
              title: '地球科學',
            },
            {
              key: '1002012',
              value: '1002012',
              title: '科展指導',
            }
          ]
        },
        {
          key: '1003000',
          value: '1003000',
          title: '語文',
          children: [
            {
              key: '1003001',
              value: '1003001',
              title: '英文',
            },
            {
              key: '1003002',
              value: '1003002',
              title: '英文寫作',
            },
            {
              key: '1003003',
              value: '1003003',
              title: '日文',
            },
            {
              key: '1003004',
              value: '1003004',
              title: '韓文',
            },
            {
              key: '1003005',
              value: '1003005',
              title: '德文',
            },
            {
              key: '1003006',
              value: '1003006',
              title: '法文',
            },
            {
              key: '1003007',
              value: '1003007',
              title: '西班牙文',
            },
            {
              key: '1003008',
              value: '1003008',
              title: '俄文',
            },
            {
              key: '1003009',
              value: '1003009',
              title: '粵語',
            },
            {
              key: '1003010',
              value: '1003010',
              title: '泰語',
            },
            {
              key: '1003011',
              value: '1003011',
              title: '越語',
            },
            {
              key: '1003012',
              value: '1003012',
              title: '中文(華語)',
            },
            {
              key: '1003099',
              value: '1003099',
              title: '其他語言',
            }
          ]
        },
        {
          key: '1004000',
          value: '1004000',
          title: '音樂',
          children: [
            {
              key: '1004001',
              value: '1004001',
              title: '鋼琴/電子琴',
            },
            {
              key: '1004002',
              value: '1004002',
              title: '大/小提琴',
            },
            {
              key: '1004003',
              value: '1004003',
              title: '吉他',
            },
            {
              key: '1004004',
              value: '1004004',
              title: '烏克麗麗',
            },
            {
              key: '1004005',
              value: '1004005',
              title: '樂理/創作',
            },
            {
              key: '1004006',
              value: '1004006',
              title: '打擊樂器',
            },
            {
              key: '1004007',
              value: '1004007',
              title: '管樂器',
            },
            {
              key: '1004008',
              value: '1004008',
              title: '國樂',
            },
            {
              key: '1004009',
              value: '1004009',
              title: '歌唱',
            },
            {
              key: '1004099',
              value: '1004099',
              title: '其他樂器',
            }
          ]
        },
        {
          key: '1005000',
          value: '1005000',
          title: '休閒才藝',
          children: [
            {
              key: '1005001',
              value: '1005001',
              title: '書法',
            },
            {
              key: '1005002',
              value: '1005002',
              title: '繪畫',
            },
            {
              key: '1005003',
              value: '1005003',
              title: '棋藝',
            },
            {
              key: '1005004',
              value: '1005004',
              title: '珠心算',
            },
            {
              key: '1005005',
              value: '1005005',
              title: '手作',
            },
            {
              key: '1005006',
              value: '1005006',
              title: '攝影',
            },
            {
              key: '1005099',
              value: '1005099',
              title: '其他才藝',
            }
          ]
        },
        {
          key: '1006000',
          value: '1006000',
          title: '術科/職場技能',
          children: [
            {
              key: '1006001',
              value: '1006001',
              title: '文書處理',
            },
            {
              key: '1006002',
              value: '1006002',
              title: '財會/金融類',
            },
            {
              key: '1006003',
              value: '1006003',
              title: '行銷廣告類',
            },
            {
              key: '1006004',
              value: '1006004',
              title: '資訊軟體系統類',
            },
            {
              key: '1006005',
              value: '1006005',
              title: '設計類',
            },
            {
              key: '1006006',
              value: '1006006',
              title: '電子/機械類',
            },
            {
              key: '1006007',
              value: '1006007',
              title: '專案管理類',
            },
            {
              key: '1006008',
              value: '1006008',
              title: 'EMBA/MBA',
            },
            {
              key: '1006009',
              value: '1006009',
              title: '美妝技巧',
            },
            {
              key: '1006010',
              value: '1006010',
              title: '檢定考試',
            },
            {
              key: '1006099',
              value: '1006099',
              title: '其它技能',
            }
          ]
        },
        {
          key: '1007000',
          value: '1007000',
          title: '體育/舞蹈',
          children: [
            {
              key: '1007001',
              value: '1007001',
              title: '游泳',
            },
            {
              key: '1007002',
              value: '1007002',
              title: '球類運動',
            },
            {
              key: '1007003',
              value: '1007003',
              title: '武術',
            },
            {
              key: '1007004',
              value: '1007004',
              title: '幼兒律動',
            },
            {
              key: '1007005',
              value: '1007005',
              title: '溜冰',
            },
            {
              key: '1007006',
              value: '1007006',
              title: '滑板',
            },
            {
              key: '1007007',
              value: '1007007',
              title: '直排輪',
            },
            {
              key: '1007008',
              value: '1007008',
              title: '競技體操',
            },
            {
              key: '1007009',
              value: '1007009',
              title: '舞蹈',
            },
            {
              key: '1007099',
              value: '1007099',
              title: '其他運動',
            }
          ]
        }
      ]
    },
    {
      key: '2000000',
      value: '2000000',
      title: '圖像/製圖',
      children: [
        {
          key: '2001000',
          value: '2001000',
          title: '平面設計/美編',
        },
        {
          key: '2002000',
          value: '2002000',
          title: '貼圖/插畫設計',
        },
        {
          key: '2003000',
          value: '2003000',
          title: '建築設計',
        },
        {
          key: '2004000',
          value: '2004000',
          title: '室內設計',
        },
        {
          key: '2005000',
          value: '2005000',
          title: '舞台/展場設計',
        },
        {
          key: '2006000',
          value: '2006000',
          title: '景觀園藝設計',
        },
        {
          key: '2007000',
          value: '2007000',
          title: '服飾設計製作',
        },
        {
          key: '2008000',
          value: '2008000',
          title: '產品與工業設計',
        },
        {
          key: '2009000',
          value: '2009000',
          title: '水電及工程繪圖',
        },
        {
          key: '2010000',
          value: '2010000',
          title: '電子電路設計',
        }
      ]
    },
    {
      key: '3000000',
      value: '3000000',
      title: '編輯/翻譯',
      children: [
        {
          key: '3001000',
          value: '3001000',
          title: '文字創作',
        },
        {
          key: '3002000',
          value: '3002000',
          title: '採訪編輯',
        },
        {
          key: '3003000',
          value: '3003000',
          title: '同步口譯',
        },
        {
          key: '3004000',
          value: '3004000',
          title: '文字翻譯',
        },
        {
          key: '3005000',
          value: '3005000',
          title: '教材編寫',
        },
        {
          key: '3006000',
          value: '3006000',
          title: '書籍編輯',
        },
        {
          key: '3007000',
          value: '3007000',
          title: '排版/校對',
        },
        {
          key: '3008000',
          value: '3008000',
          title: '文字KEY-IN',
        },
        {
          key: '3009000',
          value: '3009000',
          title: '聽打',
        }
      ]
    },
    {
      key: '4000000',
      value: '4000000',
      title: '資訊網路',
      children: [
        {
          key: '4001000',
          value: '4001000',
          title: '網頁設計',
        },
        {
          key: '4002000',
          value: '4002000',
          title: '通訊/網路工程',
        },
        {
          key: '4003000',
          value: '4003000',
          title: '資料庫工程',
        },
        {
          key: '4004000',
          value: '4004000',
          title: '程式開發',
        },
        {
          key: '4005000',
          value: '4005000',
          title: '聊天機器人建置',
        },
        {
          key: '4006000',
          value: '4006000',
          title: 'QC/QA',
        },
        {
          key: '4007000',
          value: '4007000',
          title: '韌體/硬體程式',
        },
        // {
        //   key: '4008000',
        //   value: '4008000',
        //   title: '硬體設計',
        // },
        {
          key: '4009000',
          value: '4009000',
          title: 'ERP規劃',
        },
        {
          key: '4010000',
          value: '4010000',
          title: 'IT技術諮詢',
        }
      ]
    },
    {
      key: '5000000',
      value: '5000000',
      title: '行銷/廣告',
      children: [
        {
          key: '5001000',
          value: '5001000',
          title: 'SEO/關鍵字',
        },
        {
          key: '5002000',
          value: '5002000',
          title: '社群經營',
        },
        {
          key: '5003000',
          value: '5003000',
          title: '網站分析',
        },
        {
          key: '5004000',
          value: '5004000',
          title: '網路廣告',
        },
        // {
        //   key: '5005000',
        //   value: '5005000',
        //   title: '關鍵字廣告',
        // },
        {
          key: '5006000',
          value: '5006000',
          title: '部落客/網紅',
        },
        {
          key: '5007000',
          value: '5007000',
          title: '市場調查',
        },
        {
          key: '5008000',
          value: '5008000',
          title: '行銷企劃',
        }
      ]
    },
    {
      key: '6000000',
      value: '6000000',
      title: '影音/活動',
      children: [
        {
          key: '6001000',
          value: '6001000',
          title: '音樂創作',
        },
        {
          key: '6002000',
          value: '6002000',
          title: '配音',
        },
        {
          key: '6003000',
          value: '6003000',
          title: '多媒體動畫',
        },
        {
          key: '6004000',
          value: '6004000',
          title: '影像拍攝/後製',
        },
        {
          key: '6005000',
          value: '6005000',
          title: '活動企劃/主持',
        },
        {
          key: '6006000',
          value: '6006000',
          title: '造型設計',
        },
        {
          key: '6007000',
          value: '6007000',
          title: '表演者與DJ',
        },
        {
          key: '6008000',
          value: '6008000',
          title: '模特兒/演員',
        }
      ]
    },
    {
      key: '7000000',
      value: '7000000',
      title: '商務支援',
      children: [
        {
          key: '7001000',
          value: '7001000',
          title: '產品企劃',
        },
        {
          key: '7002000',
          value: '7002000',
          title: '專業諮詢',
        },
        {
          key: '7003000',
          value: '7003000',
          title: '品牌創建',
        },
        {
          key: '7004000',
          value: '7004000',
          title: '商業營運諮詢',
        },
        {
          key: '7005000',
          value: '7005000',
          title: '會計與稅務',
        },
        {
          key: '7006000',
          value: '7006000',
          title: '投資理財諮詢',
        },
        {
          key: '7007000',
          value: '7007000',
          title: '職涯諮詢/履歷健診',
        },
        {
          key: '7008000',
          value: '7008000',
          title: '電銷/客服',
        },
        {
          key: '7009000',
          value: '7009000',
          title: '行政支援/商品上架',
        }
      ]
    },
    {
      key: '8000000',
      value: '8000000',
      title: '生活相關',
      children: [
        {
          key: '8001000',
          value: '8001000',
          title: '房屋裝修',
        },
        {
          key: '8002000',
          value: '8002000',
          title: '水電工程',
        },
        {
          key: '8003000',
          value: '8003000',
          title: '清潔服務',
        },
        {
          key: '8004000',
          value: '8004000',
          title: '手工藝/代工',
        },
        {
          key: '8005000',
          value: '8005000',
          title: '家事/服務代辦',
        },
        {
          key: '8006000',
          value: '8006000',
          title: '3C維修',
        },
        // {
        //   key: '8007000',
        //   value: '8007000',
        //   title: '居家照護',
        // },
        {
          key: '8008000',
          value: '8008000',
          title: '健身美體/芳療',
        },
        {
          key: '8009000',
          value: '8009000',
          title: '占卜/心靈成長',
        },
        {
          key: '8010000',
          value: '8010000',
          title: '寵物服務',
        }
      ]
    }
  ]
};
